app/views/home/main.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 1]]
---
                  <span class="label label-success">
                    <i class="fa fa-pencil"></i> <%=book.reviews.length%> <%='review'.pluralize(book.reviews.length)%>