app/controllers/home_controller.rb

  def main
    @books = []
    all_books = Book.all
---
SELECT "books".* FROM "books"