app/controllers/reviews_controller.rb

  def create
    #review = @book.reviews.new(content: review_params[:content])
    review = @book.reviews.new(review_params)
    review.user = @current_user
    review.save
---
INSERT INTO "reviews" ("content", "book_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "the book is better than the movie!"], ["book_id", 5], ["user_id", 1], ["created_at", "2016-03-04 06:10:16.348543"], ["updated_at", "2016-03-04 06:10:16.348543"]]

    def set_book
      @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT 1  [["id", 1]]